Hadoop .
        проект фонда Apache Software Foundation, свободно распространяемый набор утилит, библиотек 
        и фреймворк для разработки и выполнения распределённых программ, работающих на кластерах 
        из сотен и тысяч узлов.

        это набор инструментов для построения системы работы с большими данными. 
        Он предназначен для сбора, хранения и распределённой обработки сотен терабайт информации, 
        которая поступает непрерывным потоком. 
        Она состоит из четырёх ключевых компонентов:`HDFS, YARN, MapReduce и Common.` 
        Есть ещё несколько десятков дополнительных инструментов, в том числе от сторонних разработчиков.